Revit 2027 API
BuiltInFailures.RebarCouplerFailures.WidthParameterWarning Property
 This is used to post warning. The "External Diameter" parameter must be set to a strictly positive value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId WidthParameterWarning { get; }
Public Shared ReadOnly Property WidthParameterWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ WidthParameterWarning {
	FailureDefinitionId^ get ();
}
static member WidthParameterWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarCouplerFailures Class
Autodesk.Revit.DB Namespace